Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: A type-erased wrapper over any collection with indices that support forward traversal.
ja: 前へ辿っていくことをサポートするインデックスを持つあらゆるコレクションを覆う型消去ラッパー。

source: A type-erased wrapper over any collection with indices that support random access traversal.
ja: 無作為アクセスで辿っていくことをサポートするインデックスを持つあらゆるコレクションを覆う型消去ラッパー。

source: A unique identifier for a class instance or metatype.
ja: あるクラスインスタンスまたはメタタイプのための固有な識別子。

source: A unit of scheduleable work.
ja: 予定可能な仕事の単位。

source: A user-defined key for providing context during encoding and decoding.
ja: エンコーディングおよびデコーディングの間にコンテキストを提供するためのユーザ定義のキー。

source: A valid index of the array.
ja: この配列の有効なインデックス。

source: A valid index of the collection to use as a limit.
ja: 限度として使うためのそのコレクションの有効なインデックス。

source: A valid index of the collection.
ja: そのコレクションの有効なインデックス。

source: A value equal to +infinity.
ja: +infinityに等しい値。

source: A value equal to -infinity.
ja: -infinityに等しい値。

source: A value equal to zero with a negative sign.
ja: 負の符号を持つゼロに等しい値。

source: A value equal to zero with a positive sign.
ja: 正の符号を持つゼロに等しい値。

source: A value from which to use the magnitude.
ja: そこからの値が規模に使われることになります。

source: A value from which to use the sign.
ja: それからの値が符号に使われることになります。

source: A value less than or equal to the number of elements in the collection.
ja: このコレクションの中の要素の数より少ないか等しい値。

source: A value less than or equal to the number of elements in the sequence, calculated nondestructively.
ja: シーケンスの要素数より少ないか等しい値、非破壊的に計算されます。

source: A value of NaN contains the string "nan", case insensitive.
ja: NaNの値は、文字列"nan"を含みます、大文字小文字に影響されずに。

source: A value of infinity contains one of the strings "inf" or "infinity", case insensitive.
ja: 無限大の値は、文字列"inf"または"infinity"のうちの１つを含みます、大文字小文字に影響されずに。

source: A value that is NaN (“not a number”) cannot be represented exactly if its payload cannot be encoded exactly.
ja: NaN（非数）である値は、それのペイロードが正確にエンコードされないならば、正確に表現できません。

source: A value that is offset from this value by n.
ja: この値からnをオフセットされる値。

source: A value to add to the hasher.
ja: ハーシャーに加える値。

source: A value to compare.
ja: 比較する値。

source: A value to convert to this type of integer.
ja: この型の整数へと変換される値。

source: A value to either return or throw from the continuation.
ja: その継続から返すまたはスローするどちらかの値。

source: A value to match against pattern.
ja: patternと照合することになるある値。

source: A value to use as a default.
ja: 省略時のものとして使うための値。

source: A value to use as the big-endian representation of the new integer.
ja: 新しい整数のビッグエンディアン表現として使う値。

source: A value to use as the little-endian representation of the new integer.
ja: 新しい整数のリトルエンディアン表現として使う値。

source: A value to use as the source of the new instance’s binary representation.
ja: 新しいインスタンスの持つバイナリ表現のソースとして使うための値。

source: A value type whose instances are either true or false.
ja: ある値型、そのインスタンスはtrueかfalseです。

source: A value’s floatingPointClass property describes its “class” as described by the IEEE 754 specification.
ja: ある値のfloatingPointClassプロパティは、それの“class”をIEEE 754仕様で記述される通りに記述します。

source: A variadic list of elements of the new array.
ja: 新しい配列の要素からなる可変長引数リスト。

source: A view of a character’s contents as a collection of UTF-16 code units.
ja: ある文字のもつ内容のひとつの見方、いくらかのUTF-16コード単位のコレクションとして。

source: A view of a character’s contents as a collection of UTF-8 code units.
ja: ある文字のもつ内容のひとつの見方、いくらかのUTF-8コード単位のコレクションとして。

source: A view of a dictionary’s keys.
ja: 辞書のもつキーのあるビュー

source: A view of a dictionary’s values.
ja: 辞書のもつ値のあるビュー。

source: A wrapper around a C va_list pointer.
ja: C va_listポインタの周りのラッパー。

source: A wrapper around an opaque C pointer.
ja: 不透明Cポインターの周りのラッパー。

source: A wrapper over an underlying index that hides the specific underlying type.
ja: 根底にあるインデックスを覆うラッパー、根底にある特定の型を隠します。

source: About Imported Cocoa Error Parameters
ja: インポートされるCocoaエラーパラメータについて

source: Access Swift types and declarations from within your Objective-C codebase.
ja: Swift型と宣言にあなたのObjective-Cコードベース内からアクセスします。

source: Access classes and other declarations from your Objective-C code in Swift.
ja: SwiftにおいてあなたのObjective-Cコード由来のクラスおよび他の宣言にアクセスします。

source: Access must only occur through the pointer argument to body until body returns.
ja: アクセスは、bodyに対するポインタ引数を通して、bodyが返るまでに、発生するだけでなければなりません。

source: Access the ith element of the raw array pointed to by self.
ja: selfによって指し示される生の配列のi番目の要素にアクセスします。

source: Access to the raw argc value from C.
ja: Cからの生のargc値にアクセスします。

source: Access to the raw argv value from C. Accessing the argument vector through this pointer is unsafe.
ja: 生のargv値にCからアクセスします。引数ベクトルにこのポインタを通してアクセスすることは安全ではありません。

source: Access to the swift arguments, also use lazy initialization of static properties to safely initialize the swift arguments.
ja: swift引数にアクセスします、また静的プロパティの遅延初期化を使って安全にswift引数を初期化します。

source: Access your Swift code from within your Objective-C codebase, and your Objective-C code from Swift.
ja: あなたのSwiftコードにあなたのObjective-Cコードベース内からアクセスします、そしてあなたのObjective-CコードにSwiftからアクセスします。

source: Accesses a contiguous subrange of the array’s elements.
ja: 配列のもつ要素らの中のある連続した下位範囲にアクセスします。

source: Accesses a contiguous subrange of the collection’s elements.
ja: コレクションのもついくらかの要素からなるある連続した下位範囲にアクセスします。

source: Accesses the contiguous subrange of the collection’s elements specified by a range expression.
ja: 範囲式によって指定される、コレクションの要素からなる連続した下位範囲にアクセスします。

source: Accesses the element at position.
ja: positionでの要素にアクセスします。

source: Accesses the element at specified position.
ja: 指定された位置で要素にアクセスします。

source: Accesses the element at the given position.
ja: 与えられた位置での要素にアクセスします。

source: Accesses the element at the specified index.
ja: 指定されたインデックスでの要素にアクセスします。

source: Accesses the element at the specified position.
ja: 指定された位置で要素にアクセスします。

source: Accesses the element indicated by position.
ja: positionによって指し示される要素にアクセスします。

source: Accesses the key-value pair at the specified position.
ja: 指定された位置でキー値ペアにアクセスします。

source: Accesses the value associated with the given key for reading and writing.
ja: 与えられたキーに結び付けられる値に読出しと書き込みのためにアクセスします。

source: Accesses the value with the given key, falling back to the given default value if the key isn’t found.
ja: 値にこの与えられたキーでアクセスします、キーが見つけられないならばその与えられた省略時の値まで後退します。

source: Accessing pointee as a type that is unrelated to the underlying memory’s bound type is undefined.
ja: 基礎をなすメモリの境界型と関係のない型としてpointeeにアクセスすることは、未定義です。

source: Accessing Arguments
ja: 引数にアクセスする

source: Accessing Array Values
ja: 配列の値にアクセスする

source: Accessing Cases
ja: ケース節にアクセスする

source: Accessing Elements
ja: 要素にアクセスする

source: Accessing Individual Elements
ja: 個々の要素にアクセスする

source: Accessing Keys and Values
ja: キーと値にアクセスする

source: Accessing Numeric Constants
ja: 数に関する定数にアクセスする

source: Accessing Objective-C Methods and Properties
ja: Objective-Cのメソッドやプロパティへのアクセス

source: Accessing Raw Argument Data
ja: 生の引数データにアクセスする

source: Accessing Slices of a Collection
ja: あるコレクションのスライスにアクセスする

source: Accessing Underlying Storage
ja: 基礎をなすストレージにアクセスする

source: Accessing a Collection's Elements
ja: コレクションのもつ要素にアクセスする

source: Accessing a Pointer's Memory
ja: ポインタの持つメモリにアクセスする

source: Accessing a type’s description property directly or using CustomStringConvertible as a generic constraint is discouraged.
ja: ある型のもつdescriptionプロパティに直にアクセスすることやCustomStringConvertibleを総称体制約として使うことは推奨されません。

source: Actor types implicitly conform to this protocol.
ja: アクター型それらは、暗黙的にこのプロトコルに準拠します。

source: Adapting Textual Sequences
ja: テキストシーケンスに適応する

source: Add CustomDebugStringConvertible conformance to your custom types by defining a debugDescription property.
ja: CustomDebugStringConvertible準拠をあなたのあつらえの型にdebugDescriptionプロパティを定義することによって加えてください。

source: Add CustomStringConvertible conformance to your custom types by defining a description property.
ja: CustomStringConvertible準拠をあなたのあつらえの型にdescriptionプロパティを定義することによって加えてください。

source: Add Equatable and Hashable to the list of adopted protocols when declaring the type, and the compiler automatically fills in the requirements for the two protocols:
ja: EquatableおよびHashableを型を宣言する時に採用するプロトコルのリストに加えてください、するとコンパイラは自動的に２つのプロトコルに対する要件を満たします：

source: Add Comparable conformance to your own custom types when you want to be able to compare instances using relational operators or use standard library methods that are designed for Comparable types.
ja: あなたが関係演算子を使ってインスタンスの比較ができること、または Comparable型のために設計される標準ライブラリメソッドを使うことを望む場合は、Comparable準拠をあなた独自のあつらえの型に加えてください。

source: Add multiple elements at the same time by passing another array or a sequence of any kind to the append(contentsOf:) method.
ja: append(contentsOf:)メソッドに別の配列や何らかの種類のシーケンスを渡すことによって、複数の要素を同時に加えてください。

source: Add new interpolation behavior to existing types by extending DefaultStringInterpolation, the type that implements interpolation for types like String and Substring, to add an overload of appendInterpolation(_:) with their new behavior.
ja: 新しい補間挙動を既存の型それらに追加することをDefaultStringInterpolation、StringおよびSubstringのような型に補間を実装する型、を拡張してそれらの新しい挙動をもつappendInterpolation(_:)のオーバーロードを加えることで行います。

source: Add the capability to be initialized with an array literal to your own custom types by declaring an init(arrayLiteral:) initializer.
ja: init(arrayLiteral:)イニシャライザを宣言することによって、配列リテラルで初期化される能力をあなた独自のあつらえの型に加えてください。

source: Adding Equatable conformance to your custom types means that you can use more convenient APIs when searching for particular instances in a collection.
ja: Equatable準拠をあなたのあつらえの型に追加することが意味するのは、あなたがより便利なAPIを特定のインスタンスをあるコレクションの中で探す時に使用できるということです。

source: Adding Elements
ja: 要素の追加

source: Adding Keys and Values
ja: キーと値を追加する

source: Adding Values
ja: 値を加える

source: Adding and Removing Elements
ja: 要素の追加と削除

source: Additional Considerations
ja: 追加の考慮すべきこと

source: AdditiveArithmetic Implementations
ja: 加法算術の実装

source: Adds a new element at the end of the array.
ja: 新しい要素を配列の終わりに加えます。

source: Adds the contents of the given buffer to this hasher, mixing it into the hasher state.
ja: 与えられたバッファの内容をこのハーシャーに加えます、それをハーシャー状態へと混ぜ入れます。

source: Adds the elements of a sequence or collection to the end of this collection.
ja: あるシーケンスまたコレクションに属するいくつかの要素をこのコレクションの終わりに加えます。

source: Adds the elements of a sequence to the end of the array.
ja: あるシーケンスに属する要素を配列の終わりに加えます。

source: Adds the given value to this hasher, mixing its essential parts into the hasher state.
ja: 与えられた値をこのハーシャーに加えます、それの本質的部分それらをハーシャー状態に混ぜ合わせます。

source: Adds the product of the two given values to this value in place, computed without intermediate rounding.
ja: ２つの与えられた値の積をこの値にその場で加えます、中間の丸めなしで計算されます。

source: Adds two values and produces their sum, rounded to a representable value.
ja: ２つの値を加算してそれらの合計を生成します、表現可能な値へ丸められます。

source: Adds two values and produces their sum.
ja: ２つの値を加算してそれらの合計を生成します。

source: Adds two values and stores the result in the left-hand-side variable, rounded to a representable value.
ja: ２つの値を加算して、結果を左手側の変数に格納します、表現可能な値へ丸められます。

source: Adds two values and stores the result in the left-hand-side variable, wrapping any overflow.
ja: ２つの値を加算して結果を左手側の変数に格納します、あらゆるオーバーフローをラップします。

source: Adds two values and stores the result in the left-hand-side variable.
ja: ２つの値を加算して、結果を左手側の変数に格納します。

source: Adopt a Delegate Protocol
ja: 委任先プロトコルを採用する

source: Adopt and interoperate with Cocoa design patterns in your Swift apps.
ja: CocoaデザインパターンをあなたのSwiftアプリにおいて採用および相互運用してください。

source: Adopting Common Protocols
ja: 一般的なプロトコルを採用する

source: Advances to the next element and returns it, or nil if no next element exists.
ja: 次の要素へ進んでそれを返します、または次の要素が存在しないならばnilを返します。

source: After resume enqueues the task, control immediately returns to the caller.
ja: resumeがタスクを待ち行列に入れた後、制御はすぐに呼び出し側へと返ります。

source: After adding CustomDebugStringConvertible conformance by implementing the debugDescription property, Point provides its own custom debugging representation.
ja: CustomDebugStringConvertible準拠をdebugDescriptionプロパティを実装することによって追加後は、Pointはそれ独自のあつらえのデバッグ表現を提供します。

source: After assigning the new value ("Butler") at a specific position, that value is immediately available at that same position.
ja: 新しい値（"Butler"）を指定された位置で割り当てた後、その値はすぐにその同じ位置で利用可能になります。

source: After implementing the description property and declaring CustomStringConvertible conformance, the Point type provides its own custom representation.
ja: descriptionプロパティの実装とCustomStringConvertible準拠の宣言の後は、Point型はそれ自身のあつらえの表現を提供します。

source: After partitioning a collection, there is a pivot index p where no element before p satisfies the belongsInSecondPartition predicate and every element at or after p satisfies belongsInSecondPartition.
ja: コレクションを仕切った後、あるピボットインデックスpがあります、そこでpの前の要素は１つもbelongsInSecondPartition述部を満たさず、そしてpでのまたは後のあらゆる要素はbelongsInSecondPartitionを満たします。

source: After passing the unsafe continuation to this initializer, don’t use it outside of this object.
ja: その非安全継続をこのイニシャライザに渡した後、それをこのオブジェクトの外側で使わないでください。

source: After reaching the maximum number of elements, subsequent calls to next() return nil.
ja: 要素の最大数に到達した後、next()へのその後の呼び出しはnilを返します。

source: After reaching the number of elements to drop, this iterator passes along the result of calling next() on the base iterator.
ja: 抜かす要素の数に到達した後、このイテレータはnext()を基底イテレータ上で呼び出す結果をずっと渡します。

source: After returning nil (or throwing an error) from next(), the iterator enters a terminal state, and all future calls to next() must return nil.
ja: next()からnilを返す（またはエラーをスローする）後、イテレータはある終端状態に入ります、そしてnext()への全ての未来の呼び出しは、nilを返さなければなりません。

source: After that, the iterator returns values received from its base iterator as-is, and never executes the predicate closure again.
ja: その後、イテレータはそれの基底イテレータから受け取った値をそのまま返します、そして決して述部クロージャを再び遂行しません。

source: After the Cake structure has been imported, you can use the default initializer to create an instance and use it as follows:
ja: Cake構造体がインポートされた後、あなたは省略時のイニシャライザを使うことでインスタンスを作成してそれを以下のように使用できます：

source: After the predicate returns false, the sequence never executes it again, and from then on the sequence passes through elements from its underlying sequence as-is.
ja: 述部がfalseを返した後、シーケンスはそれを決して再び遂行しません、そしてそれからシーケンス上では、要素それらをそれの基礎をなすシーケンスからそのままでずっと渡します。

source: After the predicate returns false, the sequence never executes it again, and from then on the sequence passes through elements from its underlying sequence.
ja: 述部がfalseを返した後、シーケンスはそれを決して再び遂行しません、そしてその時からシーケンスは要素それらをそれの基礎をなすシーケンスからずっと渡します。

source: After the predicate returns false, for a value received from the base iterator, this method returns that value.
ja: 述部がfalseを返した後、基底イテレータから受け取った値に対して、このメソッドはその値を返します。

source: After this method returns, the task group is guaranteed to be empty.
ja: このメソッドが復帰した後、タスクグループは空であることを保証されます。

source: After using firstIndex(of:) to find the position of a particular element in a collection, you can use it to access the element by subscripting.
ja: firstIndex(of:)を使って特定の要素の位置をあるコレクションの中で見つけた後、あなたは添え字によって要素にアクセスするのにそれを使うことができます。

source: After using lastIndex(of:) to find the position of the last instance of a particular element in a collection, you can use it to access the element by subscripting.
ja: lastIndex(of:)を使って特定の要素の最後のインスタンスの位置をあるコレクションの中で見つけた後、あなたは添え字によって要素にアクセスするのにそれを使うことができます。

source: After you import an Objective-C framework, a C library, or a header file, you can work with Objective-C classes and protocols, as well as common C constructs, functions, and patterns.
ja: あなたがObjective-Cフレームワーク、Cライブラリ、またはあるヘッダファイルをインポートした後、あなたはObjective-Cのクラスとプロトコル、それだけでなく一般的なC構造体、関数、そしてパターンを扱うことができます。

source: Aliases for Imported C Types
ja: インポートされたC型に対するエイリアス

source: All Objective-C generic type parameters imported by Swift have a type constraint that requires that type to be a class (T: AnyObject).
ja: スウィフトによってインポートされる全てのObjective-C総称体型パラメータは、ある型制約を持ちます、それはあるクラス（T: AnyObject）であることをその型に要求します。

source: All arity zero tuples are equal.
ja: 項数ゼロのタプルはすべて等しいです。

source: All associations between insertions and removals are symmetric
ja: 挿入それらと除去それらの間の全ての関係は、対照的である。

source: All elements satisfying this predicate are ordered after all elements not satisfying it.
ja: この述部を満たす全ての要素は、それを満たさない全ての要素の後に並べられます。

source: All indirectly returned Core Foundation objects are unmanaged as well.
ja: 全ての間接的に返されたコアファウンデーション・オブジェクトは、同様に管理されません。

source: All insertion offsets are unique
ja: 全ての挿入オフセットは、特有である。

source: All of the standard library’s integer types, such as Int and UInt32, conform to BinaryInteger.
ja: 標準ライブラリの持つ整数型の全て、例えばIntとUInt32などは、BinaryIntegerに準拠します。

source: All other values of the Index type, such as the startIndex property of a different collection, are invalid indices for this collection.
ja: Index型の他の値すべて、例えば異なるコレクションのstartIndexプロパティなどは、このコレクションに対する無効なインデックスです。

source: All removal offsets are unique
ja: 全ての除去オフセットは、特有である。

source: All the elements following the specified position are moved to close the gap.
ja: 指定された位置に続く要素すべては、隙間を埋めるように移動されます。

source: All the elements following the specified position are moved up to close the gap.
ja: 指定された位置に続く要素すべては、隔たりを埋めるように繰り上げられます。

source: All values other than NaN and infinity are considered finite, whether normal or subnormal.
ja: NaNと無限大の他の全ての値は、ノーマルまたはサブノーマルかにかかわらず、有限と見なされます。

source: Allows a nonescaping closure to temporarily be used as if it were allowed to escape.
ja: 非脱出クロージャに、一時的にそれが脱出することを許可されたかのように使われることを許可します。

source: Along with defining the type of values as an associated type called Element, the AsyncSequence defines a makeAsyncIterator() method.
ja: 値それらの型をElementと呼ばれる関連型として定義することに加えて、AsyncSequenceはmakeAsyncIterator()メソッドを定義します。

source: Also, the dictionary doesn’t provide a key for 4, and the closure throws an error for any key it can’t look up, so receiving this value from Counter ends the modified sequence with an error.
ja: また、辞書は4に対するキーを提供しません、そしてクロージャはそれが見つけることが出来ない何らかのキーに対してエラーをスローします、それでこの値をCounterから受け取ることはこの修正されたシーケンスをエラーで終わらせます。

source: Alternatively, a predicate can be satisfied by a range of Equatable elements or a general condition.
ja: あるいは、述部は、Equatable要素のある範囲またはある一般的条件によって満たされることができます。

source: Alternatively, if you need to test whether obj.getIntegerValue() exists, use optional binding before calling the method.
ja: あるいは、あなたがobj.getIntegerValue()が存在するかテストする必要があるならば、オプショナル束縛をそのメソッドを呼び出す前に使ってください。

source: Alternatively, use this method to sort a collection of elements that do conform to Comparable when you want the sort to be descending instead of ascending.
ja: そうではなくて、あなたが昇順ではなく降順でソートしたい場合は、このメソッドを使ってComparableに準拠する要素からなるコレクションをソートしてください。

source: Alternatively, you can call asyncUnlessCancelled(priority:operation:), which doesn’t create the task if the group has already been canceled Choosing between these two functions lets you control how to react to cancellation within a group: some child tasks need to run regardless of cancellation and others are better not even being created knowing they can’t produce useful results.
ja: その代わりに、あなたはasyncUnlessCancelled(priority:operation:)を呼び出せます、それはグループが既に取り消されてしまっているならばタスクを作成しません。これら２つの関数の間から選ぶことは、あなたにグループ内の取り消しにどのように反応するかを制御させます：いくつかの子タスクは取り消しにかかわらず動作する必要があります、そして他のものは、それらが有用な結果を生み出せないのがわかっていて、作成すらされない方が良いです。

source: Alternatively, you can create a bridging header yourself by choosing File > New > File > [operating system] > Source > Header File.
ja: あるいはまた、あなたはブリッジヘッダを、File > New > File > [オペレーションシステム] > Source > Header File を選択することであなた自身で作成できます。

source: Although Swift doesn’t support natively declared unions, a C union imported as a Swift structure still behaves like a C union.
ja: Swiftは生得的に宣言された共用体をサポートしないにもかかわらず、Swift構造体としてインポートされたC共用体は依然としてC共用体のように振る舞います。

source: Although a sequence can be consumed as it is traversed, a collection is guaranteed to be multipass: Any element can be repeatedly accessed by saving its index.
ja: シーケンスはそれが辿って行かれるとき消費されることが可能な一方、コレクションはマルチパスであることを保証されます：どんな要素もそれのインデックスを保存することによって繰り返しアクセスされます。

source: Always traps.
ja: 常にトラップします。

source: Always use the same properties in both your == and hash(into:) methods.
ja: 常に同じプロパティをあなたの==およびhash(into:)メソッドの両方において使ってください。

source: Always use the slice’s startIndex property instead of assuming that its indices start at a particular value.
ja: 常にスライスのstartIndexプロパティを使ってください、それのインデックスが特定の値で始まると決めてかかるのではなく。

source: Always use the slice’s startIndex and endIndex properties instead of assuming that its indices start or end at a particular value.
ja: 常にスライスのstartIndexとendIndexプロパティを使ってください、それのインデックスが特定の値で始まると決めてかかるのではなく。

source: Always zero, just like endIndex.
ja: 常にゼロ、ちょうどendIndexのように。

source: Always zero, just like startIndex.
ja: 常にゼロ、ちょうどstartIndexのように。

source: An 8-bit signed integer value type.
ja: 8ビット符号つき整数値型。

source: An AnyBidirectionalCollection instance forwards its operations to a base collection having the same Element type, hiding the specifics of the underlying collection.
ja: AnyBidirectionalCollectionインスタンスは、それの操作を同じElement型を持っている基盤コレクションへと転送して、基礎をなすコレクションの特殊化を隠します。

source: An AnyCollection instance forwards its operations to a base collection having the same Element type, hiding the specifics of the underlying collection.
ja: AnyCollectionインスタンスは、それの操作を同じElement型を持っている基盤コレクションへと転送して、基礎をなすコレクションの特殊化を隠します。

source: An AnyRandomAccessCollection instance forwards its operations to a base collection having the same Element type, hiding the specifics of the underlying collection.
ja: AnyRandomAccessCollectionインスタンスは、それの操作を同じElement型を持っている基盤コレクションへと転送して、基礎をなすコレクションの特殊化を隠します。

source: An AsyncSequence doesn’t generate or contain the values; it just defines how you access them.
ja: AsyncSequenceは、値それらを生成または含みません；それはただどのようにあなたがそれらにアクセスするかを定義するだけです。

source: An AsyncSequence resembles the Sequence type — offering a list of values you can step through one at a time — and adds asynchroncity.
ja: AsyncSequenceは、Sequence型に類似して — あなたが一度に１つずつ段階処理していくことができるいくつかの値からなるあるリストを提供します — そして非同期性をつけ加えます。

source: An AsyncSequence may have all, some, or none of its values available when you first use it.
ja: あるAsyncSequenceは、それの値の全て、いくつか、または０個を、あなたがそれを最初に使う時に利用可能とするかもしれません。

source: An extended grapheme cluster is a group of one or more Unicode scalar values that approximates a single user-perceived character.
ja: 拡張書記素クラスタは、ひとまとめにした１つ以上のユニコードスカラー値です、それは単一のユーザ知覚文字におおよそ相当します。

source: An Objective-C protocol-qualified metaclass is imported by Swift as a protocol metatype, which is a type that represents the type of a protocol itself.
ja: Objective-Cプロトコル適格メタクラスは、Swiftによってプロトコルメタタイプとしてインポートされます、それはプロトコルそれ自体の型を表す型です。

source: An all-zeros exponent is reserved for subnormals and zeros, and an all-ones exponent is reserved for infinity and NaN.
ja: 全てゼロの指数は非正規化数とゼロのために予約されます、そして全て１の指数は無限大とNaNのために予約されます。

source: An arity zero tuple is always after or the same as another arity zero tuple in a lexicographical ordering.
ja: 項数ゼロのタプルは、常に語彙筆記的順序において別の項数ゼロのタプルの後またはそれと同じです。

source: An arity zero tuple is always before or the same as another arity zero tuple in a lexicographical ordering.
ja: 項数ゼロのタプルは、常に語彙筆記的順序において別の項数ゼロのタプルの前またはそれと同じです。

source: An arity zero tuple is never strictly after another arity zero tuple in a lexicographical ordering.
ja: 項数ゼロのタプルは、厳密に決して語彙筆記的順序において別の項数ゼロのタプルの後ではありません。

source: An arity zero tuple is never strictly before another arity zero tuple in a lexicographical ordering.
ja: 項数ゼロのタプルは、厳密に決して語彙筆記的順序において別の項数ゼロのタプルの前ではありません。

source: An array can store any kind of elements—from integers to strings to classes.
ja: ある配列は、整数から文字列まで、あるクラスであるどんなものであることもできます。

source: An array containing the elements of this sequence in reverse order.
ja: このシーケンスの要素を逆順に含んでいる配列。

source: An array containing the transformed elements of this sequence.
ja: このシーケンスの変換済み要素を含んでいる配列。

source: An array literal is a simple way of expressing a list of values.
ja: 配列リテラルは、値のリストを表す簡単な方法です。

source: An array literal is not the same as an Array instance.
ja: 配列リテラルは、Arrayインスタンスと同じではありません。

source: An array of arguments to convert to a C va_list pointer.
ja: あるC va_listポインタに変換することになる、いくつかの引数からなる配列。
